package pm;

public class Exam8 {
	/*
	 클래스의 상속과 다형성
	 
	 상속을 이해하는 것은 객체지향 프로그래밍의 핵심이다.
	 상속은 부모 클래스의 멤버를 자식 클래스의 내부에 포함시키는 자바의 문법 요소이다.
	 
	 상속의 장점은 코드의 불필요한 중복을 제거할 수 있다.
	 즉, 자식들의 공통적인 성분을 뽑아서(추상화) 부모 클래스에 한번 정의하면 
	 코드가 아주 간결해지는 결과를 볼 수 있다.
	 
	 두번째 장점은 대학생은 대학생이다. 대학생은 사람이다. 사람은 대학생이다.(x)
	 이렇게 1개의 객체를 여러가지 모양으로 표현할 수 있는 특성을 다형성 poltmorphism이라고 한다.
	 
	 자바에서는 다중상속을 허용하지 않는다. (단, 다중 구현은 허용한다.)
	 
	 생성자의 상속
	 클래스가 상속을 받으면 부모클래스의 모든 멤버를 내려받는다라고 했지만
	 이 멤버는 필드 메서드 이너 클래스를 말하게 된다.
	 즉, 생성자는 자식 클래스로 상속 되지 않는다.
	 
	 */

}
